<?php
/*
各プログラムで処理結果を格納するクラス
*/
class result{
	private $data = Array();
	
	/*****************************************************
	コンストラクタ
	*****************************************************/
	public function __construct(){
		
	}
	
	/*****************************************************
	ペアデータを追加
	*****************************************************/
	public function add($name, $data) {
		$this->data[$name] = $data;
	}
	
	/*****************************************************
	キー指定でデータを取得
	*****************************************************/
	public function get($name, $defaultval = "") {
		if (array_key_exists($name, $this->data)){
			return $this->data[$name];
		}else{
			return $defaultval;
		}
	}
	
	/*****************************************************
	デストラクタ
	*****************************************************/
	public function __destruct(){
		unset($this->data);
	}
}
?>